# # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # #
#                                                                   #
#                                註解                               #
#                                                                   #
# # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # # #

#單行註解

"""
多行註解
多行註解
多行註解
"""


'''
多行註解
多行註解
多行註解
'''


def func1():
    """我是 func1 註解
可以擁有多行"""

print(func1.__doc__)


class MyClz:
    '''我是 Class 註解
可以擁有多行'''
    pass

print(MyClz.__doc__)